s = """Ну это короче типа переводчик на непонятные символы, чтобы было непонятно, хотя этот процесс нужно
оптимизировать"""

alphabet_rus = ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у",
"ф", "х", "ц","ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"]

alphabet_eng = ["a", "b", "v", "g", "d", "e", "''e", "j", "z", "i", "'y", "k", "l", "m", "n", "o", "p", "r", "s", "t",
"u", "f", "h", "c", "'ch", "'sh", "''sh", "''b", "''y", "'b", "'e", "'u", "''ia"]

for i, e in enumerate(s):
    for i in range(len(alphabet_rus)):
        s = s.replace(alphabet_rus[i], alphabet_eng[i])

answer = s